# DataFrame

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame()

In [3]:
df1

Empty DataFrame
Columns: []
Index: []

In [4]:
type(df1)

pandas.core.frame.DataFrame

In [5]:
dict1 = {'ID' : [1, 2, 3, 4, 5],
        'Nome' : ['Caio', 'Rodrigo', 'Rafael', 'Mariane', 'Nathane']}

In [6]:
dict1

{'ID': [1, 2, 3, 4, 5],
 'Nome': ['Caio', 'Rodrigo', 'Rafael', 'Mariane', 'Nathane']}

In [7]:
df2 = pd.DataFrame(data = dict1)

In [8]:
df2

   ID     Nome
0   1     Caio
1   2  Rodrigo
2   3   Rafael
3   4  Mariane
4   5  Nathane

In [9]:
df3 = pd.DataFrame(data = dict1, index = [29, 1, 0, 222, 88] )

In [10]:
df3

     ID     Nome
29    1     Caio
1     2  Rodrigo
0     3   Rafael
222   4  Mariane
88    5  Nathane

In [11]:
serie1 = pd.Series([1, 2, 3])

In [12]:
serie1

0    1
1    2
2    3
dtype: int64

In [13]:
type(serie1)

pandas.core.series.Series

In [14]:
serie2 = pd.Series(['a', 'b', 'c'])

In [15]:
serie2

0    a
1    b
2    c
dtype: object

In [16]:
df4 = pd.DataFrame({'coluna1' : serie1, 'coluna2' : serie2})

In [17]:
df4

   coluna1 coluna2
0        1       a
1        2       b
2        3       c

In [18]:
import numpy as np

In [19]:
array1 = np.array([[1, 2, 3], ['São Paulo', 'Rio de Janeiro', 'Campinas'], ['SP', 'RJ', 'SP']])

In [20]:
array1

array([['1', '2', '3'],
       ['São Paulo', 'Rio de Janeiro', 'Campinas'],
       ['SP', 'RJ', 'SP']], dtype='<U14')

In [21]:
type(array1)

numpy.ndarray

In [22]:
df5 = pd.DataFrame(data = array1.transpose(), index = ['Linha1', 'Linha2', 'Linha3'], columns = ['ID', 'Cidade', 'Estado'])

In [23]:
df5

       ID          Cidade Estado
Linha1  1       São Paulo     SP
Linha2  2  Rio de Janeiro     RJ
Linha3  3        Campinas     SP

In [24]:
matrix1 = np.matrix([[1, 2, 3], ['São Paulo', 'Rio de Janeiro', 'Campinas'], ['SP', 'RJ', 'SP']])

In [25]:
type(matrix1)

numpy.matrix

In [26]:
df6 = pd.DataFrame(data = matrix1.transpose(), index = ['Linha1', 'Linha2', 'Linha3'], columns = ['ID', 'Cidade', 'Estado'])

In [27]:
df6

       ID          Cidade Estado
Linha1  1       São Paulo     SP
Linha2  2  Rio de Janeiro     RJ
Linha3  3        Campinas     SP

### Selecionando DataFrame (Slicing)

In [28]:
df3

     ID     Nome
29    1     Caio
1     2  Rodrigo
0     3   Rafael
222   4  Mariane
88    5  Nathane

In [29]:
df3['ID+5'] = df3['ID'] + 5

In [30]:
df3

     ID     Nome  ID+5
29    1     Caio     6
1     2  Rodrigo     7
0     3   Rafael     8
222   4  Mariane     9
88    5  Nathane    10

In [31]:
df3['Index'] = 0

In [32]:
df3

     ID     Nome  ID+5  Index
29    1     Caio     6      0
1     2  Rodrigo     7      0
0     3   Rafael     8      0
222   4  Mariane     9      0
88    5  Nathane    10      0

In [33]:
df3.index = [29, 0, 1, 2222, 88]

In [34]:
df3

      ID     Nome  ID+5  Index
29     1     Caio     6      0
0      2  Rodrigo     7      0
1      3   Rafael     8      0
2222   4  Mariane     9      0
88     5  Nathane    10      0

In [35]:
df3['ID']

29      1
0       2
1       3
2222    4
88      5
Name: ID, dtype: int64

In [36]:
df3['Nome']

29         Caio
0       Rodrigo
1        Rafael
2222    Mariane
88      Nathane
Name: Nome, dtype: object

In [37]:
df3.Nome

29         Caio
0       Rodrigo
1        Rafael
2222    Mariane
88      Nathane
Name: Nome, dtype: object

In [38]:
df3[['ID','Nome']]

      ID     Nome
29     1     Caio
0      2  Rodrigo
1      3   Rafael
2222   4  Mariane
88     5  Nathane

In [39]:
df3[df3.ID % 2 == 0] # Selecionando os dados onde o ID for numero par

      ID     Nome  ID+5  Index
0      2  Rodrigo     7      0
2222   4  Mariane     9      0

In [40]:
df3[df3.Nome.str.contains('R')] # Selecionando os dados onde os nomes contenha a letra R

   ID     Nome  ID+5  Index
0   2  Rodrigo     7      0
1   3   Rafael     8      0

In [41]:
df3[(df3.Nome.str.contains('R')) & (df3.ID == 3)] # Selecionando os dados onde os nomes contenha a letra R e o ID for igual a 3

   ID    Nome  ID+5  Index
1   3  Rafael     8      0

In [42]:
df3[(df3.Nome.str.contains('R')) | (df3.ID == 5)] # Selecionando os dados onde os nomes contenha a letra R ou ID for igual a 5

    ID     Nome  ID+5  Index
0    2  Rodrigo     7      0
1    3   Rafael     8      0
88   5  Nathane    10      0

### loc e iloc
- **loc:** Localizar pelo **NOME** dos Índices ou Colunas
- **iloc:** Localizar pela **POSIÇÃO** dos Índices ou Colunas

In [43]:
df3

      ID     Nome  ID+5  Index
29     1     Caio     6      0
0      2  Rodrigo     7      0
1      3   Rafael     8      0
2222   4  Mariane     9      0
88     5  Nathane    10      0

In [44]:
df3.loc[0]

ID             2
Nome     Rodrigo
ID+5           7
Index          0
Name: 0, dtype: object

In [45]:
df3.iloc[0]

ID          1
Nome     Caio
ID+5        6
Index       0
Name: 29, dtype: object

In [46]:
df3.loc[0:1]

   ID     Nome  ID+5  Index
0   2  Rodrigo     7      0
1   3   Rafael     8      0

In [47]:
df3.iloc[0:1]

    ID  Nome  ID+5  Index
29   1  Caio     6      0

In [48]:
df3.iloc[0:2]

    ID     Nome  ID+5  Index
29   1     Caio     6      0
0    2  Rodrigo     7      0

In [49]:
df3.loc[88:1:-1]

      ID     Nome  ID+5  Index
88     5  Nathane    10      0
2222   4  Mariane     9      0
1      3   Rafael     8      0

In [50]:
df3

      ID     Nome  ID+5  Index
29     1     Caio     6      0
0      2  Rodrigo     7      0
1      3   Rafael     8      0
2222   4  Mariane     9      0
88     5  Nathane    10      0

In [51]:
df3.loc[:,'Nome'] # Puxando coluna pelo nome com loc

29         Caio
0       Rodrigo
1        Rafael
2222    Mariane
88      Nathane
Name: Nome, dtype: object

In [52]:
df3.iloc[:, 1] # Puxando coluna pelo nome com iloc

29         Caio
0       Rodrigo
1        Rafael
2222    Mariane
88      Nathane
Name: Nome, dtype: object

In [53]:
df3.loc[2222,'Nome']

'Mariane'

In [54]:
df3.iloc[3, 1]

'Mariane'

In [55]:
df3.loc[2222, 'Nome'] = 'Jeremias' # Trocando nome Mariane por Jeremias utilizando loc

In [56]:
df3

      ID      Nome  ID+5  Index
29     1      Caio     6      0
0      2   Rodrigo     7      0
1      3    Rafael     8      0
2222   4  Jeremias     9      0
88     5   Nathane    10      0

In [57]:
df3.iloc[-1] # Puxando a ultima posicao com iloc

ID             5
Nome     Nathane
ID+5          10
Index          0
Name: 88, dtype: object

In [58]:
df3.iloc[-1, -2] # Puxando o valor da penultima coluna da ultima linha

10

In [59]:
df3.loc[[0, 2222]] # Puxando duas linhas - Linha 0 e 2222

      ID      Nome  ID+5  Index
0      2   Rodrigo     7      0
2222   4  Jeremias     9      0

In [60]:
df3.iloc[[1, 3]] # Puxando duas linhas - Linha nas posicoes 1 e 3

      ID      Nome  ID+5  Index
0      2   Rodrigo     7      0
2222   4  Jeremias     9      0

### DataFrame - Atributos

In [61]:
df3

      ID      Nome  ID+5  Index
29     1      Caio     6      0
0      2   Rodrigo     7      0
1      3    Rafael     8      0
2222   4  Jeremias     9      0
88     5   Nathane    10      0

In [62]:
df3.dtypes # Informa as colunas e os tipos dos valores contidos

ID        int64
Nome     object
ID+5      int64
Index     int64
dtype: object

In [63]:
df3.ID = df3.ID.astype(str) # Transformando tipo int da coluna ID para tipo String

In [64]:
df3.dtypes

ID       object
Nome     object
ID+5      int64
Index     int64
dtype: object

In [65]:
df3

     ID      Nome  ID+5  Index
29    1      Caio     6      0
0     2   Rodrigo     7      0
1     3    Rafael     8      0
2222  4  Jeremias     9      0
88    5   Nathane    10      0

In [66]:
df3['teste1'] = [None, 2, 4, None, 10] # Adicionando nova coluna - None se tornara NaN na tabela - Tipo da Nova coluna sera float64 por conta dos valores nulos e numericos

In [67]:
df3

     ID      Nome  ID+5  Index  teste1
29    1      Caio     6      0     NaN
0     2   Rodrigo     7      0     2.0
1     3    Rafael     8      0     4.0
2222  4  Jeremias     9      0     NaN
88    5   Nathane    10      0    10.0

In [68]:
df3.dtypes

ID         object
Nome       object
ID+5        int64
Index       int64
teste1    float64
dtype: object

In [69]:
df3.columns # Puxando a lista com todas as colunas

Index(['ID', 'Nome', 'ID+5', 'Index', 'teste1'], dtype='object')

In [70]:
df3.columns = ['ID', 'Nome', 'ID+5', 'Index_MODIFICADO', 'teste1']

In [71]:
df3

     ID      Nome  ID+5  Index_MODIFICADO  teste1
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0

In [72]:
df3.index # Puxando a lista com todos os indices

Int64Index([29, 0, 1, 2222, 88], dtype='int64')

In [73]:
df3.shape # Puxando numero de linhas e colunas

(5, 5)

In [74]:
df3.values # Puxando valores do DataFrame - Cada linha se torna uma lista

array([['1', 'Caio', 6, 0, nan],
       ['2', 'Rodrigo', 7, 0, 2.0],
       ['3', 'Rafael', 8, 0, 4.0],
       ['4', 'Jeremias', 9, 0, nan],
       ['5', 'Nathane', 10, 0, 10.0]], dtype=object)

### DataFrame - Métodos

- Método **combine_First()**

In [75]:
df3

     ID      Nome  ID+5  Index_MODIFICADO  teste1
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0

In [76]:
df3.teste1.combine_first(df3['ID+5']) # Retorna os valores de teste1 PORÉM Se o valor da coluna teste1 for nulo, será pego o valor correspondente da coluna ID+5

29       6.0
0        2.0
1        4.0
2222     9.0
88      10.0
Name: teste1, dtype: float64

- Método **copy()**

In [77]:
df1000 = df3.copy() # Copiando um DataFrame para outro

In [78]:
df1000

     ID      Nome  ID+5  Index_MODIFICADO  teste1
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0

- Método **count()**

In [79]:
df1000.count() # Retorna as colunas e a quantidade de registros nao nulos

ID                  5
Nome                5
ID+5                5
Index_MODIFICADO    5
teste1              3
dtype: int64

- Método **drop()**

In [80]:
df3

     ID      Nome  ID+5  Index_MODIFICADO  teste1
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0

In [81]:
df3.drop(columns = ['Index_MODIFICADO']) # Retorna apenas o resultado da operacao de exclusao PORÉM NAO ALTERA o DataFrame original

     ID      Nome  ID+5  teste1
29    1      Caio     6     NaN
0     2   Rodrigo     7     2.0
1     3    Rafael     8     4.0
2222  4  Jeremias     9     NaN
88    5   Nathane    10    10.0

In [82]:
df3

     ID      Nome  ID+5  Index_MODIFICADO  teste1
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0

In [83]:
df3.drop(columns = ['Index_MODIFICADO'], inplace=True) # Atributo inplace=True para excluir a coluna no DataFrame original
# OU df3 = df3.drop(columns = ['Index_MODIFICADO'])

In [84]:
df3

     ID      Nome  ID+5  teste1
29    1      Caio     6     NaN
0     2   Rodrigo     7     2.0
1     3    Rafael     8     4.0
2222  4  Jeremias     9     NaN
88    5   Nathane    10    10.0

In [85]:
df3.drop(index = [88], inplace=True) # Removendo dados do indice 88

In [86]:
df3

     ID      Nome  ID+5  teste1
29    1      Caio     6     NaN
0     2   Rodrigo     7     2.0
1     3    Rafael     8     4.0
2222  4  Jeremias     9     NaN

- Método **drop_duplicates()**

In [87]:
df7 = pd.concat([df1000, df1000]) # Adicionando duas vezes o DataFrame df1000 no DataFrame df7

In [88]:
df7

     ID      Nome  ID+5  Index_MODIFICADO  teste1
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0

In [89]:
df7.drop_duplicates(inplace=True) # Removendo registros duplicados

In [90]:
df7

     ID      Nome  ID+5  Index_MODIFICADO  teste1
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0

- Método **dropna()**

In [91]:
df8 = df7.copy() # Copiando do DataFrame df7 para o DataFrame df8

In [92]:
df8

     ID      Nome  ID+5  Index_MODIFICADO  teste1
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0

In [93]:
df8.dropna(inplace=True) # Removendo valores nulos do DataFrame

In [94]:
df8

   ID     Nome  ID+5  Index_MODIFICADO  teste1
0   2  Rodrigo     7                 0     2.0
1   3   Rafael     8                 0     4.0
88  5  Nathane    10                 0    10.0

- Método **fillna()**

In [95]:
df7

     ID      Nome  ID+5  Index_MODIFICADO  teste1
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0

In [96]:
df7.fillna('NULO', inplace=True)

In [97]:
df7

     ID      Nome  ID+5  Index_MODIFICADO teste1
29    1      Caio     6                 0   NULO
0     2   Rodrigo     7                 0    2.0
1     3    Rafael     8                 0    4.0
2222  4  Jeremias     9                 0   NULO
88    5   Nathane    10                 0   10.0

- Método **head()**

In [98]:
df7.head(2) # Devolve apenas o numero de linhas solicitado como atributo DO INICIO

   ID     Nome  ID+5  Index_MODIFICADO teste1
29  1     Caio     6                 0   NULO
0   2  Rodrigo     7                 0    2.0

- Método **tail()**

In [99]:
df7.tail(2) # Devolve apenas o numero de linhas solicitado como atributo DO FIM

     ID      Nome  ID+5  Index_MODIFICADO teste1
2222  4  Jeremias     9                 0   NULO
88    5   Nathane    10                 0   10.0

- Método **groupby()**

In [100]:
df10 = pd.concat([df1000, df1000])

In [101]:
df10

     ID      Nome  ID+5  Index_MODIFICADO  teste1
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0
29    1      Caio     6                 0     NaN
0     2   Rodrigo     7                 0     2.0
1     3    Rafael     8                 0     4.0
2222  4  Jeremias     9                 0     NaN
88    5   Nathane    10                 0    10.0

In [102]:
df10.groupby(['Nome']).ID.sum() # Somando o valor ID agrupando por nomes - O resultado apenas juntou os valores por ser tipo String

Nome
Caio        11
Jeremias    44
Nathane     55
Rafael      33
Rodrigo     22
Name: ID, dtype: object

- Método **isin()**

In [105]:
df3

     ID      Nome  ID+5  teste1
29    1      Caio     6     NaN
0     2   Rodrigo     7     2.0
1     3    Rafael     8     4.0
2222  4  Jeremias     9     NaN

In [106]:
df3.isin([2, 4]) # Isin - Metodo para slicing

         ID   Nome   ID+5  teste1
29    False  False  False   False
0     False  False  False    True
1     False  False  False    True
2222  False  False  False   False

In [107]:
df3.isin(['2', '4'])

         ID   Nome   ID+5  teste1
29    False  False  False   False
0      True  False  False   False
1     False  False  False   False
2222   True  False  False   False

In [108]:
df3[df3.isin(['2','4']) == True]

       ID Nome  ID+5  teste1
29    NaN  NaN   NaN     NaN
0       2  NaN   NaN     NaN
1     NaN  NaN   NaN     NaN
2222    4  NaN   NaN     NaN

In [115]:
df3[df3.ID.isin(['2','4']) == True] # Trazendo os dados apenas onde o campo ID for igual a 2 e 4 em formato texto

     ID      Nome  ID+5  teste1
0     2   Rodrigo     7     2.0
2222  4  Jeremias     9     NaN

In [114]:
df3[df3.teste1.isin([2, 4]) == True] # Trazendo os dados apenas onde o campo teste1 for igual a 2 e 4 em formato numerico

  ID     Nome  ID+5  teste1
0  2  Rodrigo     7     2.0
1  3   Rafael     8     4.0

- Método de **Operações Matemáticas**

In [130]:
df3.teste1.min() # Puxando o valor minimo da coluna teste1

2.0

In [131]:
df3.teste1.max() # Puxando o valor maximo da coluna teste1

4.0

In [132]:
df3.teste1.mean() # Puxando a media da coluna teste1

3.0

In [134]:
df3.teste1.median() # Puxando a mediana da coluna teste1

3.0

In [135]:
df3.teste1.sum() # Puxando a soma da coluna teste1

6.0

In [136]:
df3.teste1.std() # Puxando o desvio padrao da coluna teste1

1.4142135623730951

- Método **notnull()**

In [137]:
df3

     ID      Nome  ID+5  teste1
29    1      Caio     6     NaN
0     2   Rodrigo     7     2.0
1     3    Rafael     8     4.0
2222  4  Jeremias     9     NaN

In [138]:
df3.teste1.notnull() # Retorna os dados da coluna teste1 onde sao e nao sao nulos

29      False
0        True
1        True
2222    False
Name: teste1, dtype: bool

In [140]:
df3[df3.teste1.notnull() == True] # Trazendo os dados do DataFrame onde nao sao nulos na coluna teste1

  ID     Nome  ID+5  teste1
0  2  Rodrigo     7     2.0
1  3   Rafael     8     4.0

- Método **rename()**

In [141]:
df3

     ID      Nome  ID+5  teste1
29    1      Caio     6     NaN
0     2   Rodrigo     7     2.0
1     3    Rafael     8     4.0
2222  4  Jeremias     9     NaN

In [145]:
df3.rename(columns={'ID+5' : 'ID_mais_cinco'}, inplace=True) # Alterando o nome da coluna ID+5 para ID_mais_cinco

In [146]:
df3

     ID      Nome  ID_mais_cinco  teste1
29    1      Caio              6     NaN
0     2   Rodrigo              7     2.0
1     3    Rafael              8     4.0
2222  4  Jeremias              9     NaN

In [149]:
df3.rename(index={2222 : -1}, inplace=True) # Alterando o index de 2222 para -1

In [150]:
df3

    ID      Nome  ID_mais_cinco  teste1
 29  1      Caio              6     NaN
 0   2   Rodrigo              7     2.0
 1   3    Rafael              8     4.0
-1   4  Jeremias              9     NaN

- Método **replace()**

In [151]:
df3

    ID      Nome  ID_mais_cinco  teste1
 29  1      Caio              6     NaN
 0   2   Rodrigo              7     2.0
 1   3    Rafael              8     4.0
-1   4  Jeremias              9     NaN

In [152]:
df3.Nome.replace('Jeremias', 'Mariane', inplace=True) # Alterando dado da coluna Nome - Trocando Jeremias por Mariane

In [153]:
df3

    ID     Nome  ID_mais_cinco  teste1
 29  1     Caio              6     NaN
 0   2  Rodrigo              7     2.0
 1   3   Rafael              8     4.0
-1   4  Mariane              9     NaN

- Método **round()**

In [154]:
df3['teste2'] = [1.2, 3.6451, 2.98018, 9.13] # Criando coluna e adicionando dados para demonstracao do metodo round()

In [155]:
df3

    ID     Nome  ID_mais_cinco  teste1   teste2
 29  1     Caio              6     NaN  1.20000
 0   2  Rodrigo              7     2.0  3.64510
 1   3   Rafael              8     4.0  2.98018
-1   4  Mariane              9     NaN  9.13000

In [157]:
df3.teste2.round(0) # Arredondando o valor dos dados da coluna teste2 para zero casas decimais

 29    1.0
 0     4.0
 1     3.0
-1     9.0
Name: teste2, dtype: float64

In [159]:
df3.teste2.round(1) # Arredondando o valor dos dados da coluna teste2 para uma casa decimal

 29    1.2
 0     3.6
 1     3.0
-1     9.1
Name: teste2, dtype: float64

In [162]:
df3.teste2 = df3.teste2.round(1) # Arredondando os valores e salvando no DataFrame df3

In [163]:
df3

    ID     Nome  ID_mais_cinco  teste1  teste2
 29  1     Caio              6     NaN     1.2
 0   2  Rodrigo              7     2.0     3.6
 1   3   Rafael              8     4.0     3.0
-1   4  Mariane              9     NaN     9.1

- Método **to_clipboard()**

In [164]:
df3.to_clipboard() # Este comando copia o DataFrame para área de transferência (É possível dar um Ctrl+V no Excel)

In [165]:
df3.to_clipboard(index=False) # Mesmo comando que o anterior porém removendo o index